


{"country": "India", "title": "Python Developer", "location": "Chennai, Tamil Nadu, India", "level": "Executive", "type": "Full-time", "function": "Engineering and Information Technology", "description": ["We are looking for a Python Developer to join our engineering team and help us develop and maintain various software products.", "Python Developer responsibilities include writing and testing code, debugging programs and integrating applications with third-party web services. To be successful in this role, you should have experience using server-side logic and work well in a team.", "Ultimately, youll build highly responsive web applications that align with our business needs.", "Write effective, scalable code", "Develop back-end components to improve responsiveness and overall performance", "Integrate user-facing elements into applications", "Test and debug programs", "Improve functionality of existing systems", "Implement security and data protection solutions", "Assess and prioritize feature requests", "Coordinate with internal teams to understand user requirements and provide technical solutions", "Write effective, scalable code", "Develop back-end components to improve responsiveness and overall performance", "Integrate user-facing elements into applications", "Test and debug programs", "Improve functionality of existing systems", "Implement security and data protection solutions", "Assess and prioritize feature requests", "Coordinate with internal teams to understand user requirements and provide technical solutions", "Work experience as a Python Developer", "Expertise in at least one popular Python framework (like Django, Flask or Pyramid)", "Knowledge of object-relational mapping (ORM)", "Familiarity with front-end technologies (like JavaScript and HTML5)", "Team spirit", "Good problem-solving skills", "BSc in Computer Science, Engineering or relevant field", "Work experience as a Python Developer", "Expertise in at least one popular Python framework (like Django, Flask or Pyramid)", "Knowledge of object-relational mapping (ORM)", "Familiarity with front-end technologies (like JavaScript and HTML5)", "Team spirit", "Good problem-solving skills", "BSc in Computer Science, Engineering or relevant field", ""]},
{"country": "India", "title": "AI /ML Engineer Junior", "location": "Hyderabad, Telangana, India", "level": "Entry level", "type": "Full-time", "function": "Engineering and Information Technology", "description": ["", "Description", "What we are looking for:", "As an AI/ML Engineer at Meltwater, you'll play a vital role in building cutting-edge social solutions for our global client base within the Explore mission. We're seeking a proactive, quick-learning engineer who thrives in a collaborative environment.", "Meltwater development teams take full ownership of their subsystems and infrastructure, including running on-call rotations. With a heavy reliance Software Engineer in AI/ML and Data Science. We seek individuals with experience in Cloud infrastructure and containerization, Docker, Azure or AWS is required (Azure is preferred). Data Preparation, Model Lifecycle (training, serving and registries) & Natural language Processing (NLP) and LLMs", "In this role, you'll have the opportunity to push the boundaries of our technology stack, from modifying open-source libraries to innovating with existing technologies. If you're passionate about distributed systems at scale and finding new ways to extract insights from vast amounts of data, we invite you to join us in this exciting journey.", "What You'll Bring:", "Bachelor's or master's degree in computer science or equivalent degree or demonstrable experience.", "Proven experience as a Software Engineer in AI/ML and Data Science.", "Minimum of 2-4 years of working experience.", "Strong working experience in Python and software engineering principles (2+ Years)", "Experience with cloud infrastructure and containerization (1+ Years).", "Docker is required.", "Experience with TensorFlow / PyTorch (2+ Years)", "Experience with ML-Ops Principles (1+ Years)", "Data Preparation", "Model Lifecycle (training, serving and registries)", "Sound knowledge on any cloud (AWS/Azure).", "Good theoretical knowledge of AI / Data Science in one or more of the following areas:", "Natural language Processing (NLP) and LLMs.", "Neural Networks", "Topic modelling and clustering", "Time Series Analysis (TSA), including anomaly detection, trend analysis, and forecasting)", "Retrieval Augmented Generation", "Speech to Text.", "Excellent communication and collaboration skills.", "What We Offer:", "Enjoy comprehensive paid time off options for enhanced work-life balance.", "Comprehensive health insurance tailored for you.", "Employee assistance programs cover mental health, legal, financial, wellness, and behaviour areas to ensure your overall well-being.", "Energetic work environment with a hybrid work style, providing the balance you need.", "Benefit from our family leave program, which grows with your tenure at Meltwater.", "Thrive within our inclusive community and seize ongoing professional development opportunities to elevate your career.", "Where You'll Work: Hitec city, Hyderabad.", "When You'll Join: As per the offer letter.", "Our Story", "The sky is the limit at Meltwater.", "At Meltwater, we believe that when you have the right people in the right working environment, great things happen. Our best-in-class technology empowers our 27,000 customers around the world to analyse over a billion pieces of data each day and make better business decisions.", "Our award-winning culture is our north star and drives everything we do – from striving to create an environment where all employees do their best work, to delivering customer value by continuously innovating our products — and making sure to celebrate our successes and have fun along the way.", "We’re proud of our diverse team of 2,300+ employees in 50 locations across 25 countries around the world. No matter where you are, you’ll work with people who care about your success and get the support you need to reach your goals.", "So, in a nutshell, that's Meltwater. We love working here, and we think you will too.", "Equal Employment Opportunity Statement", "Meltwater is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: At Meltwater, we are dedicated to fostering an inclusive and diverse workplace where every employee feels valued, respected, and empowered. We are committed to the principle of equal employment opportunity and strive to provide a work environment that is free from discrimination and harassment.", "All employment decisions at Meltwater are made based on business needs, job requirements, and individual qualifications, without regard to race, colour, religion or belief, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, marital status, veteran status, or any other status protected by the applicable laws and regulations.", "Meltwater does not tolerate discrimination or harassment of any kind, and we actively promote a culture of respect, fairness, and inclusivity. We encourage applicants of all backgrounds, experiences, and abilities to apply and join us in our mission to drive innovation and make a positive impact in the world."]},
{"country": "India", "title": "Director, Data Platform Engineering", "location": "Chennai, Tamil Nadu, India", "level": "Director", "type": "Full-time", "function": "Engineering", "description": ["We are looking for experienced cloud data platform engineering/development leader who could join our cloud product engineering team to lead the data platform of ValGenesis's next generation applications. If you are a technology leader and have passion to develop highly scalable and highly performant enterprise cloud products, we are eager to discuss with you about the potential role.", "Responsibilities:", "Platform Design and Architecture: Lead the design and architecture of our data platform infrastructure, collaborating with cross-functional teams to define requirements, select technologies, and develop scalable and resilient architecture.", "Platform Implementation: Oversee the implementation and deployment of data platform solutions, including data storage, data processing, and integration components, ensuring adherence to best practices, standards, and security protocols.", "Platform Monitoring and Optimization: Establish monitoring and alerting mechanisms to proactively monitor the health, performance, and availability of data platforms, identifying and addressing issues and optimizing resource utilization.", "Platform Access Management: Manage data platform access including cloud storage, databases, data warehouses, data lakes and other cloud services.", "Platform Storage and Management: Manage data storage solutions, including data pipeline, ETL, databases, data warehouses, data lakes, and cloud storage services, optimizing performance, reliability, and cost-effectiveness.", "Documentation: Maintain comprehensive documentation of data platform, access management processes, platform monitoring, platform usage, and post-implementation reviews for stakeholders and management.", "Platform Security and Compliance: Ensure the security and compliance of data platforms with industry regulations and best practices, implementing access controls, encryption, and data governance policies to protect sensitive data assets.", "Data Integration: Lead efforts to integrate data from disparate sources, systems, and applications into a unified data ecosystem, collaborating with IT, engineering, and business teams to design and implement effective data integration solutions.", "Data Processing and Analytics: Implement data processing and analytics capabilities, including batch processing, real-time streaming, and data analytics frameworks, to enable advanced data analysis and insights generation.", "Vendor Management: Manage relationships with data platform vendors and service providers, evaluating vendor offerings and ensuring the delivery of high-quality services and support.", "Team Leadership: Lead and mentor a team of data platform engineers providing guidance, coaching, and support to foster a culture of collaboration, innovation, and continuous learning.", "Stakeholder Communication: Communicate regularly with stakeholders, including IT, business, and executive leadership, to provide updates on data platform initiatives, solicit feedback, and align platform strategies with business goals and priorities.", "Requirements", "Bachelor's degree or Master's degree in computer science, information systems or related field.", "Proven track record with at least 10+ years of experience in data engineering, dataOps for a large-scale data platform serving multiple business lines and products, including hands-on design and implementation experience.", "5+ years of experience in a leadership role, managing and scaling engineering teams.", "Extensive experience in designing solutions on High trust/PCI-compliant cloud data platform.", "Deep knowledge and rich experience in data ingestions, including streaming technology and systems.", "Strong experience in data management and analytics tools and technologies, such as SQL, NoSQL databases, MS SQL Server, Distribute PostgreSQL, Citus, SSRS, SSIS, Hadoop, Spark, Databricks, Kafka, and cloud-based data lake platforms.", "Strong expertise in designing and building scalable data pipelines, ETL processes, and analytics solutions using cloud services, ETL tools, Snowflake etc.", "Proficiency with data platform architecture, design, data dictionaries, multi-dimensional models, objects, star and snowflake schemas as well as structures for data lakes, data science, and data warehouses.", "Experience in migrating data from existing warehouses or transactional data stores (SQL Server) to cloud data platform.", "Experience in software development with programming languages like Python, C#, or Scala.", "Strong understanding and practical experience with CI/CD pipelines, automated testing, and agile methodologies.", "Experience in BI / Reporting tools like Apache Superset, PowerBI.", "Experience with data platform automation, orchestration, and containerization tools (e.g., Ansible, Kubernetes, Docker) for managing and deploying platform infrastructure and services.", "Solid understanding of data security principles, practices, and compliance requirements, including GDPR, HIPAA, SOC 2, and PCI-DSS, and experience implementing security controls and measures.", "Experience with AI/ML data models, data modeling, data governance is preferred", "Excellent leadership and management skills, with the ability to lead and motivate a team, set clear goals and expectations, and drive performance and results.", "Strong analytical and problem-solving skills, with the ability to analyze complex data platform challenges, identify solutions, and implement effective strategies to achieve desired outcomes.", "Excellent communication and interpersonal skills, with the ability to communicate effectively with technical and non-technical stakeholders, build consensus, and influence decision-making.", "Experience working in regulated industries such as pharma, health sciences with knowledge of compliance requirements and standards related to data management and privacy (e.g., HIPAA, GDPR) is preferred.", "Benefits", "We're on a Mission", "In 2005, we disrupted the life sciences industry by introducing the world's first digital validation lifecycle management system. ValGenesis VLMS® revolutionized compliance-based corporate validation activities and has remained the industry standard.", "Today, we continue to push the boundaries of innovation ― enhancing and expanding our portfolio beyond validation with an end-to-end digital transformation platform. We combine our purpose-built systems with world-class consulting services to help every facet of GxP meet evolving regulations and quality expectations.", "The Team You'll Join", "Our customers' success is our success. We keep the customer experience centered in our decisions, from product to marketing to sales to services to support. Life sciences companies exist to improve humanity's quality of life, and we honor that mission.", "We work together. We communicate openly, support each other without reservation, and never hesitate to wear multiple hats to get the job done", "We think big. Innovation is the heart of ValGenesis. That spirit drives product development as well as personal growth. We never stop aiming upward", "We're in it to win it. We're on a path to becoming the number one intelligent validation platform in the market, and we won't settle for anything less than being a market leader.", "How We Work", "Our Chennai and Bangalore offices are onsite, 5 days per week. We believe that in-person interaction and collaboration fosters creativity, and a sense of community, and is critical to our future success as a company.", "ValGenesis is an equal-opportunity employer that makes employment decisions on the basis of merit. Our goal is to have the best-qualified people in every job. All qualified applicants will receive consideration for employment without regard to race, religion, sex, sexual orientation, gender identity, national origin, disability, or any other characteristics protected by local law."]},
{"country": "India", "title": "AVP Manager-Data Engineering", "location": "Bengaluru, Karnataka, India", "level": "Full-time", "type": "not-found", "function": "not-found", "description": ["", "Job Summary", "Moody’s Ratings’ AI Analytics group develops advanced machine learning solutions for high-profile data science initiatives. To strengthen our team, we seek an experienced Data Engineer to design, build, and maintain our cloud-based data infrastructure. The successful candidate will work closely with data scientists, software engineers, and other data engineers to develop scalable and efficient data pipelines, enabling seamless data ingestion, transformation, and processing.", "", "The AVP Manager-Data Engineering will mentor junior team members and actively participate in their growth. The successful candidate will also strive to meet Moody’s values: openness, diversity, inclusivity, respect, and a willingness to learn.", "", "Responsibilities", "", "Design and implement scalable, fault-tolerant data pipelines on AWS using services like AWS Redshift, RDS, Glue, and EMR.", "Develop and optimize efficient data processing workflows using Python, PySpark and SQL.", "Build and maintain ETL/ELT processes for structured and unstructured data sources.", "Collaborate with data scientists and analysts to understand data requirements and provide optimized solutions.", "Ensure data quality, integrity, and security across various stages of the data pipeline.", "Implement best practices for data governance, monitoring, and automation.", "Troubleshoot and resolve data pipeline issues, optimizing performance and reliability.", "Manage and maintain database schemas and structure.", "", "", "Mandatory Qualifications", "Bachelor’s degree in computer science, engineering, or a related field.", "6+ years of hands-on experience in data engineering roles.", "Understanding of machine learning and AI concepts.", "Proficient in Python, Pyspark and SQL for data manipulation and processing.", "Solid understanding of AWS data services.", "Proven experience in data modeling and database design (e.g. SQL, NoSQL).", "Strong problem-solving and analytical skills.", "Familiarity with data governance and data quality practices.", "Experience in management.", "", "Preferred Qualifications", "AWS certifications (e.g., AWS Certified Data Analytics).", "Experience with big data technologies (e.g., Apache Spark, Hadoop).", "Familiarity with CI/CD practices and DevOps tools (e.g., Git, Jenkins).", "Knowledge of data streaming and real-time data processing.", "", "Moody’s is an equal-opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, sex, gender, age, religion, national origin, citizen status, marital status, physical or mental disability, military or veteran status, sexual orientation, gender identity, gender expression, genetic information, or any other characteristic protected by law. Moody’s also provides reasonable accommodation to qualified individuals with disabilities or based on a sincerely held religious belief in accordance with applicable laws. If you need to inquire about a reasonable accommodation, or need assistance with completing the application process, please email accommodations@moodys.com. This contact information is for accommodation requests only, and cannot be used to inquire about the status of applications.", ""]},
{"country": "India", "title": "Digital Leader - Site Operations", "location": "Jamnagar, Gujarat, India", "level": "Full-time", "type": "Information Technology and Manufacturing", "function": "Manufacturing and Services for Renewable Energy", "description": ["", "About Reliance New Energy", "Reliance Industries Limited is a Fortune Global 500® company, ranked 86 on the list, and India’s largest private sector company, with a consolidated revenue of INR 10,00,122 crore (US$ 119.9 billion) and net profit of INR 79,020 crore (US$ 9.5 billion) for the year ended March 31, 2024. It is among the “TIME100 Most Influential Companies” for 2024 and is the top-ranked Indian company to work with in Forbes’ “World's Best Employers” list for 2023. Reliance’s activities span hydrocarbon exploration and production, petroleum refining and marketing, petrochemicals, advanced materials and composites, renewables (solar and hydrogen), financial services, retail, and digital services.", "Reliance has committed to an ambitious target of achieving net-zero carbon status by 2035, and its New Energy business is a key driver to achieving this.", "Reliance is building a fully integrated, end-to-end green energy ecosystem that spans solar, hydrogen, fuel cells, mobility, energy storage, power electronics, batteries, wind, and bioenergy.", "Spread over 5,000 acres, the Dhirubhai Ambani Green Energy Giga Complex in Jamnagar will be among the largest integrated renewable energy manufacturing facilities in the world.", "To learn more about RIL, visit www.ril.com", "Job Summary", "As the Digital Leader for the Manufacturing business at site, the candidate shall be responsible for overseeing and driving digital initiatives across various aspects of manufacturing operations.", "The role shall involve managing infrastructure planning and provisioning, data operations/management, Manufacturing Execution System (MES), line of business apps development, digital operations support, automation, and simulation.", "The candidate shall lead the Site digital team and collaborate with cross-functional stakeholders to optimize processes, enhance data management, and drive operational efficiency through digital solutions.", "Roles and Responsibilities:", "Lead the digital transformation efforts within the Solar Manufacturing business, aligning with the organization's strategic goals.", "Manage infrastructure planning and provisioning, including compute, storage, and network resources, to support digital operations and initiatives.", "Oversee data operations, including data management, data engineering, and data integration, ensuring data accuracy, availability, and security.", "Collaborate with cross-functional teams to enhance the Manufacturing Execution System (MES) and optimize its functionality to support manufacturing processes.", "Drive the development and customization of line of business applications tailored to the specific needs of the Solar Manufacturing business.", "Provide digital operations support, ensuring the smooth functioning of digital applications, systems, and tools used in manufacturing operations.", "Design & develop digital solutions to aid manufacturing operations (through material automation, material control systems), devise opportunities for automation & process optimization using digital technologies, (like robotic process automation (RPA), machine learning, and artificial intelligence).", "Develop and implement simulation models to optimize manufacturing processes, analyze performance, and support decision-making.", "Lead a team of digital professionals, providing guidance, coaching, and support to drive innovation, efficiency, and collaboration.", "Collaborate with Cybersecurity team to ensure cybersecurity measures, data privacy, governance, and compliance with enterprise standards and policies.", "Key Skills and Competencies:", "Strong leadership and strategic thinking abilities to drive digital transformation initiatives and align them with business objectives.", "In-depth knowledge of infrastructure planning and provisioning, including compute, storage, and networks, with an understanding of cloud-based solutions.", "Experience in data operations, data management, data engineering, and data integration within a manufacturing environment.", "Familiarity with Manufacturing Execution Systems (MES) and their integration with other digital solutions and manufacturing processes.", "Proficiency in line of business application development, customization, and integration, using technologies such as Java, .NET, or similar platforms.", "Knowledge of digital operations support, including application support, system maintenance, and troubleshooting.", "Understanding of automation standards (SEMI standards), machine communication protocols (SECS/GEM protocols).", "Hands on experience in digital automation, such as RPA, machine learning, and artificial intelligence, and their application in manufacturing.", "Experience in developing and implementing simulation models to optimize manufacturing processes and support decision-making.", "Excellent communication and collaboration skills to work effectively with cross-functional teams and stakeholders at all levels.", "Strong project management skills to lead digital initiatives, prioritize tasks, manage timelines, and deliver projects within specified deadlines.", "Education and Experience:", "Bachelor's or Master's degree in Computer Science, Information Systems, Industrial Engineering, or a related field.", "Minimum of 20 years of experience in digital leadership roles, preferably within the manufacturing industry (solar manufacturing / discrete manufacturing experience preferred).", "Proven experience in managing infrastructure planning, data operations, MES, line of business apps development, digital operations support, and automation projects.", "Experience with digital simulation and optimization tools is advantageous.", "Knowledge of cybersecurity practices, data privacy regulations, and compliance requirements within the manufacturing domain.", "Prior experience in leading and managing digital teams for manufacturing operations.", ""]},
{"country": "India", "title": "Associate Data Scientist", "location": "India", "level": "Full-time", "type": "not-found", "function": "not-found", "description": ["", "Overview:", "The Associate Data Scientist supports the development and implementation of data models, focusing on Machine Learning, under the supervision of more experienced scientists, contributing to the team’s innovative projects.", "Job Description:", "Assist in the development of Machine Learning models and algorithms, contributing to the design and implementation of data-driven solutions.", "Perform data preprocessing, cleaning, and analysis, preparing datasets for modeling and supporting higher-level data science initiatives.", "Learn from and contribute to projects involving Deep Learning and General AI, gaining hands-on experience under the guidance of senior data scientists.", "Engage in continuous professional development, enhancing skills in Python, Machine Learning, and related areas through training and practical experience.", "Collaborate with team members to ensure the effective implementation of data science solutions, participating in brainstorming sessions and project discussions.", "Support the documentation of methodologies and results, ensuring transparency and reproducibility of data science processes.", "Qualifications:", "Bachelor's degree in Computer Science, Statistics, Mathematics, or a related field, with a strong interest in Machine Learning, Deep Learning, and AI.", "Experience in a data science role, demonstrating practical experience and strong Python programming skills.", "Exposure to Business Intelligence (BI) & Data Engineering concepts and tools.", "Familiarity with data platforms such as Dataiku is a bonus.", "Skills:", "Solid understanding of Machine Learning principles and practical experience in Python programming.", "Familiarity with data science and machine learning libraries in Python (e.g., scikit-learn, pandas, NumPy).", "Eagerness to learn Deep Learning and General AI technologies, with a proactive approach to acquiring new knowledge and skills.", "Strong analytical and problem-solving abilities, capable of tackling data-related challenges and deriving meaningful insights.", "Basic industry domain knowledge, with a willingness to deepen expertise and apply data science principles to solve real-world problems.", "Effective communication skills, with the ability to work collaboratively in a team environment and contribute to discussions.", "﻿", "v4c.ai is an equal opportunity employer. We value diversity and are committed to creating an inclusive environment for all employees, regardless of race, color, religion, gender, sexual orientation, national origin, age, disability, or veteran status.", "We believe in the power of diversity and strive to foster a culture where every team member feels valued and respected. We encourage applications from individuals of all backgrounds and experiences.", "If you are passionate about diversity and innovation and thrive in a collaborative environment, we invite you to apply and join our team.", ""]},
{"country": "India", "title": "SDE I - Python", "location": "Bengaluru, Karnataka, India", "level": "Mid-Senior level", "type": "Full-time", "function": "Engineering and Information Technology", "description": ["", "At", "Murf AI", ", we're simplifying multimedia creation by harnessing the power of artificial intelligence. Our platform empowers users to craft high-quality voiceovers effortlessly, without the need for recording equipment.", "Some interesting facts about Murf AI:", "Customers in 100+ countries", "1Mn+ registered users", "6X growth in revenue in last 12 months", "120+ voices in 20+ languages offered by Murf Studio", "We’ve been consistently rated a Leader and Momentum Leader on G2 in the text-to-speech category in 2023 and 2022", "We are working on bleeding-edge research problems, in synthetic speech, synthetic video and dubbing", "Job Summary", ":", "We are seeking a seasoned Python Developer with", "1-3 years of experience", ". In this role, you will work closely with research engineers and linguists to develop and enhance NLP systems in the speech synthesis domain. This position requires strong analytical and critical thinking skills, effective communication, and a passion for creating high-quality software.", "Roles & Responsibilities:", "Develop NLP systems according to the project requirements", "Collaborate with international language experts to incorporate diverse linguistic features", "Work with large datasets to support language learning and model training", "Analyse and implement changes as needed, ensuring all bugs are addressed and resolved", "Deliver high-quality code with zero defects by following industry best practices and maintaining rigorous testing standards", "Contribute to patent filing and intellectual property protection activities, as applicable", "Skills & Qualifications:", "Bachelor's or Master's degree in Computer Science, Engineering, or a related field from Tier 1 Colleges", "1-3 years of experience in Python development", "Experience with NLP and machine learning frameworks such as NLTK, spaCy, TensorFlow, or PyTorch", "Strong problem-solving skills and ability to implement algorithms efficiently", "Experience working with large datasets and data preprocessing techniques", "Ability to write clean, maintainable, and efficient code", "Familiarity with version control systems (e.g., Git)", "Excellent communication skills and ability to work effectively in a team environment", "Attention to detail and commitment to delivering high-quality, bug-free software", "Extra Awesome", "Experience with speech synthesis or related domains", "Knowledge of additional programming languages like Java", "Knowledge of Web servers and databases", "Benefits/Perks:", "Collaborative and stimulating work environment", "Opportunity to work with cutting-edge technologies and make a significant impact in the field of generative video AI", "Insurance/healthcare coverage as per company policy", "Leaves available as per company policy", "Why Murf.ai?", "Murf AI is revolutionizing creative workflows for businesses through the utilization of our cutting-edge AI technology. Recognized as a consistent Leader and Momentum Leader on G2 in 2022 and 2023, we empower L&D and creative teams to evolve into dynamic creative powerhouses. With a focus on cutting-edge research and innovation, a positive work culture, and real impact in the AI-driven space, Murf.ai is one of the fastest-growing companies in the AI voice space. Join us at this pivotal moment, where your ideas matter, and your leadership can leave a lasting impact. If you're ready for a challenge and have the vision to lead from the front, Murf.ai is where your journey into the next chapter of AI innovation begins.", ""]},
{"country": "India", "title": "IN-Associate _AI/ML Python_Citizen Services_Advisory_Gugurgram", "location": "Gurugram, Haryana, India", "level": "Entry level", "type": "Full-time", "function": "Other", "description": ["", "Line of Service", "Advisory", "Industry/Sector", "Not Applicable", "Specialism", "Operations", "Management Level", "Associate", "Job Description & Summary", "A career in our Government and Public Sector Transformation Management practice, within General Consulting services, will provide you with the opportunity to help clients seize essential advantages by working alongside business leaders to solve their toughest problems and capture their greatest opportunities. We work with some of the world’s largest and most complex companies to understand their unique business issues and opportunities in an ever changing environment. We help create sustainable change by stimulating innovation, unlocking data possibilities, navigating risk and regulatory complexity, optimising deals, and aligning costs with business strategy to create a competitive advantage.", "In joining, you’ll help federal, state and local government clients solve complex business issues and manage jurisdiction related risk. You’ll help our clients assess their operational and security and data management strategies so they can continue to operate more efficiently and effectively, both today and tomorrow.", "Why PWC", "At PwC, you will be part of a vibrant community of solvers that leads with trust and creates distinctive outcomes for our clients and communities. This purpose-led and values-driven work, powered by technology in an environment that drives innovation, will enable you to make a tangible impact in the real world. We reward your contributions, support your wellbeing, and offer inclusive benefits, flexibility programmes and mentorship that will help you thrive in work and life. Together, we grow, learn, care, collaborate, and create a future of infinite experiences for each other. Learn more about us.", "At PwC, we believe in providing equal employment opportunities, without any discrimination on the grounds of gender, ethnic background, age, disability, marital status, sexual orientation, pregnancy, gender identity or expression, religion or other beliefs, perceived differences and status protected by law. We strive to create an environment where each one of our people can bring their true selves and contribute to their personal growth and the firm’s growth. To enable this, we have zero tolerance for any discrimination and harassment based on the above considerations. \"", "Responsibilities", " Capture requirements, research, plan, execute,", "evaluate, and deliver solutions to the given", "problem/project by client.", " Task planning, estimation, and delegation.", " Actively involved in designing and developing", "novel ML/DL algorithms to solve real-world", "problems using AI.", " Create PoC solutions proving the correctness and", "compliance with the acceptance criteria set by", "the stakeholders.", " Design and develop industry-strength software", "products.", "Mandatory skill sets: AI/ML, Computer Vision, Gen AI, Deep Learning, LLMs,", "Python, Open CV, NLTK, TensorFlow, PyTorch,", "LangChain, Fast API/Flask", "Preferred skill sets: Working with Cloud providers like AWS, Azure, GCP,", "SQL, Sci-kit Learn, Web/Mobile App development", "Years of experience required: 2+", "Education qualification: B Tech", "Education", "(if blank, degree and/or field of study not specified)", "Degrees/Field of Study required: Bachelor of Engineering", "Degrees/Field Of Study Preferred", "Certifications", "(if blank, certifications not specified)", "Required Skills", "Python (Programming Language)", "Optional Skills", "Desired Languages", "(If blank, desired languages not specified)", "Travel Requirements", "Available for Work Visa Sponsorship?", "Government Clearance Required?", "Job Posting End Date", ""]},
{"country": "India", "title": "Data Scientist (Risk strategy, SME)", "location": "India", "level": "Associate", "type": "Full-time", "function": "Analyst, Strategy/Planning, and Information Technology", "description": ["", "About bluCognition:", "bluCognition is an AI/ML based start-up specializing in risk analytics, data conversion and data enrichment capabilities. Founded in 2017, by some very named senior professionals from the financial services industry, the company is headquartered in the US, with the delivery center based in Pune. We build all our solutions while leveraging the latest technology stack in AI, ML and NLP combined with decades of experience in risk management at some of the largest financial services firms in the world.", "Our clients are some of the biggest and the most progressive names in the financial services industry. We are entering a significant growth phase and are looking for individuals with entrepreneurial mindset who wants us to join us in this exciting journey.", "Position: Data Scientist (Risk strategy, SME)", "About the role", "As Data Scientist in the credit risk strategy team, you will leverage your creative and critical thinking skills to develop best-in-class risk management strategies that have a meaningful impact on the client’s business. These strategies will support the client’s credit and fraud risk, customer experience, marketing verticals and beyond.", "Having you aboard will enable us to stay aligned with market trends by improving the turnaround time for developing and implementing risk strategies, allowing for quicker iterations and broader coverage in addressing business challenges through scientific methods. The core KPIs for this position include additional revenue generated and costs saved from releases. This role also supports compliance, documentation, and knowledge sharing in risk strategies.", "What you'll do", "Develop, validate and deploy risk management strategies using a combination of sophisticated data analytics and domain expertise", "Extract and explore data, validate data integrity, perform ad hoc analysis, evaluate new data sources for usage in strategy development", "Maintain robust documentation of approach and techniques used; including objectives, assumptions, performance, weaknesses, and limitations", "Be ready to adapt to new tools/libraries/technologies/platforms", "Actively partner with engineers to validate & deploy scalable solutions", "Collaborate to gather insight from partners across the organization", "Further develop expertise in data science and engineering through self-study, project exposure and guidance of senior team members", "What you'll bring", "Degree in a quantitative field (e.g., computer science, data science, engineering, economics, mathematics, etc.). Advanced degree preferred", "3+ years of Data Science experience", "2+ years in financial services", "Experience building and implementing risk strategies in production", "Deep understanding of segmentation techniques such as decision trees", "Experience in banking sector with exposure to risk management analytics", "Proficient with Python", "Proficient with SQL", "Practical experience using Spark is a plus", "Understanding of statistical modeling techniques is a plus", "Technical understanding of algorithm complexity, probability & statistics", "Self-driven with an aptitude for independent research & problem-solving", "Ability to multi-task in a fast-paced environment is essential", ""]},
{"country": "India", "title": "Associate", "location": "Mumbai, Maharashtra, India", "level": "Entry level", "type": "Full-time", "function": "Other", "description": ["", "Line of Service", "Advisory", "Industry/Sector", "FS X-Sector", "Specialism", "Risk", "Management Level", "Associate", "Job Description & Summary", "A career within Cybersecurity and Privacy services, will provide you with the opportunity to help our clients implement an effective cybersecurity programme that protects against threats, propels transformation, and drives growth. As companies pivot toward a digital business model, exponentially more data is generated and shared among organisations, partners and customers. We play an integral role in helping our clients ensure they are protected by developing transformation strategies focused on security, efficiently integrate and manage new or existing technology systems to deliver continuous operational improvements and increase their cybersecurity investment, and detect, respond, and remediate threats.", "Preferred Fields of Study: Computer and Information Science, Information Technology, Computer Applications, Computer Engineering, Information CyberSecurity", "Certification(s) Preferred: Offensive Security Certified Professional (OSCP), GIAC Penetration Tester (GPEN), Certified as GIAC Web Application Penetration Tester (GWAPT).", "Preferred Knowledge/Skills", "Demonstrates thorough knowledge and/or a proven record of success in the following areas:", "Technical concepts such as application security, network segregation, access controls, IDS/IPS devices, physical security, and information security risk management;", "Security testing tools, such as BurpSuite, Mimikatz, Cobalt Strike, PowerSploit, Metasploit, Nessus, HP Web Inspect, or other tools included within the Kali Linux distribution;", "Networking protocols, TCP/IP stack, systems architecture, and operating systems;", "Common programming and scripting languages, such as Python, PowerShell, Ruby, Perl, Bash, JavaScript, or VBScript;", "Well-known Cybersecurity frameworks and industry-leading practices such as OWASP, NIST CSF, PCI DSS, and NY-DFS; and,", "Traditional security operations, event monitoring, and Security Information and Event Management (SIEM) tools.", "Demonstrates thorough abilities and/or a proven record of success in the following areas:", "Performing penetration testing activities within a client’s environment, emphasizing manual stealthy testing techniques;", "Executing stealthy penetration testing, advanced red team, or adversary simulation engagements using commercially / freely available offensive security tools and utilities built into operating systems;", "Understanding Windows and Linux operating system setup, management, and power usage, e.g., cmd, bash, network troubleshooting, virtual machines; .", "Identifying security critical vulnerabilities without utilizing a vulnerability scanning tool, i.e., knowledge of exploitable vulnerabilities and ability to execute stealthy penetration testing engagements;", "Compromising Active Directory environments and demonstrating business impact by identifying and obtaining access to business critical assets/information;", "Performing social engineering / phishing activities such as reconnaissance of targets, developing phishing campaigns (e.g., emails and websites), web hosting administrator, developing malicious phishing payloads, or pivoting through phished systems;", "Participating actively in client discussions and meetings and communicating a broad range of potential add-on services based on identified weaknesses;", "Managing engagements with junior staff;", "Preparing concise and accurate documents, leveraging and utilizing MS Office and Google Docs to complete related project deliverables, as necessary;", "Balancing project economics management with the occurrence of unanticipated issues.", "Creating a positive environment by monitoring workloads of the team while meeting client expectations and respecting the work-life quality of team members;", "Proactively seeking guidance, clarification, and feedback; and,", "Keeping leadership informed of progress and issues.", "Mandatory Skill set-", "VAPT", "Preferred Skill Set-VAPT", "Year of experience required-2-8 years", "Qualifications-B.Tech", "Education", "(if blank, degree and/or field of study not specified)", "Degrees/Field Of Study Required", "Degrees/Field of Study preferred:", "Certifications", "(if blank, certifications not specified)", "Required Skills", "Optional Skills", "Desired Languages", "(If blank, desired languages not specified)", "Travel Requirements", "Not Specified", "Available for Work Visa Sponsorship?", "No", "Government Clearance Required?", "No", "Job Posting End Date", ""]},
{"country": "India", "title": "Software Development Engineer II", "location": "Bengaluru, Karnataka, India", "level": "Not Applicable", "type": "Full-time", "function": "Information Technology", "description": ["", "Company Description", "Tesco Bengaluru", "We are a multi-disciplinary team creating a sustainable competitive advantage for Tesco by standardising processes, delivering cost savings, enabling agility, providing cutting-edge technological solutions and empowering our colleagues to do ever more for our customers. With cross-functional expertise in Global Business Services and Retail Technology & Engineering, a wide network of teams and strong governance we reduce complexity thereby offering high quality services for our customers. Tesco Bengaluru, established in 2004 to enable standardisation and build centralised capabilities and competencies, makes the experience better for our millions of customers worldwide and simpler for over 4,40,000 colleagues.", "At Tesco Business Solutions, we have a mission to simplify, scale & partner to serve our customers, colleagues and suppliers through a best-in-class intelligent Business Services model. We do this by building a world class business services model by executing services model framework right at the heart of everything we do for our worldwide customers. The key objective is to implement and execute service model across all our functions and markets consistently. The ethos of business services is to free-up our colleagues from a regular manual operational work. We use cognitive technology to augment our key decision making. We also built a Continuous Improvement (CI) culture across functions to drive bottom-up business efficiencies by optimising processes. Business services colleagues need to act as a business partner with our group stakeholders to build a collaborative partnership driving continuous improvement across markets and functions to lead the best customer experience by serving our shoppers a little better every day.", "At Tesco, inclusion means that Everyone's Welcome. Everyone is treated fairly and with respect; by valuing individuality and uniqueness we create a sense of belonging.", "Diversity and inclusion have always been at the heart of Tesco. It is embedded in our values: we treat people how they want to be treated. We always want our colleagues to feel they can be themselves at work and we are committed to helping them be at their best.", "Across the Tesco group we are building an inclusive workplace, a place to actively celebrate the cultures, personalities and preferences of our colleagues, who in turn help to build the success of our business and reflect the diversity of the communities we serve.", "Job Description", "As a Software Development Engineer 2; you are in a team Contributor engineering role at Tesco. Your proficiency with foundational computer science and software engineering concepts is taken as a given; and you will have proven significant technical depth and breadth. You take ownership and accountability of the development of the products in your domain.", "We are part of Data Science Engineering team and work closely with data science models. As part of this team; we offer and onboard new domain works for better optimisation of tasks which would have direct impact on operational cost across Tesco stores and warehouses. As part of this role; we are looking for developers who are proficient in backend (java) and devops(github actions) as a primary skill set and he should be keen to work with public cloud platform Azure and Tesco Private cloud.", "He/ She should be able to", "Demonstrate in depth knowledge of IDE; language and toolset in java", "Implement critical path components in a large or complex or project.", "Profile and optimise code", "Understand threads; threading model and concurrent programming", "Comfortably test drive any feature/comfortable with TDD cycle", "Identify and apply appropriate design patterns to problems", "Comfortably develop large features", "Understand Idempotence", "Actively practice the boy scout principle; leaves design; code in a better state than when arrived", "Demonstrate a good understanding of cohesion; SOLID and how to apply", "Understand importance of domain model and can coherently model a problem domain within a given context", "Comfortably debug/find complex problems", "Qualifications", "Programming/Frameworks - JDK 17; Sprint Boot; Sprint Cloud; Couchbase; Kafka", "Testing - JUnit; Mocking; WireMock; Karate", "System Design - Designing Distributed; Scalable and Concurrent Systems", "Development Practise - Agile;", "Infrastructure - CI/CD using GitHub Actions;", "Software Security - Code Scans using Snyk", "Operations and Maintenance - Used NewRelic; Zendesk; XMatters", "Development Lifecycle - Agile Development Lifecycle using Scrum/Kanban", "Curiosity & Learning - Keen to understand the Why and What", "Additional Information", "Important Notice:", "On behalf of Tesco Bengaluru, we must caution all job seekers and educational institutions that Tesco Bengaluru does not authorise any third parties to release employment offers or conduct recruitment drives via a third party. Hence, beware of inauthentic and fraudulent job offers or recruitment drives from any individuals or websites purporting to represent Tesco. Further, Tesco Bengaluru does not charge any fee or other emoluments for any reason (including without limitation, visa fees) or seek compensation from educational institutions to participate in recruitment events.", "Accordingly, please check the authenticity of any such offers before acting on them and where acted upon, you do so at your own risk. Tesco Bengaluru shall neither be responsible for honouring or making good the promises made by fraudulent third parties, nor for any monetary or any other loss incurred by the aggrieved individual or educational institution.", "In the event that you come across any fraudulent activities in the name of Tesco Bengaluru, please feel free report the incident at recruitment_compliance_india@tesco.com"]},
{"country": "India", "title": "Data Analyst", "location": "Bengaluru, Karnataka, India", "level": "Entry level", "type": "Full-time", "function": "Information Technology", "description": ["Design and implement processes and solutions associated with a wide variety of data sets used for data/text mining, analysis to support informed business decisions. Gain insight into key business and deliverables by examining structured and unstructured data from multiple disparate sources. Effectively use current and emerging technologies to evaluate trends and develop actionable insights and recommendations to management, via the information available for analysis. Learn to use data, statistical and quantitative analysis, to drive decision making.", "Grade : 11", "\"Please note that the Job will close at 12am on Posting Close date, so please submit your application prior to the Close Date\"", "Job Description", "Work on advanced analytical initiatives through data analysis, and insights to enable informed business decisions in LTL and international freight. Work with cross functional teams to examine structured and unstructured data to provide insights and develop high-quality solutions. Effectively shares best practices and fosters knowledge sharing across teams. Communicates effectively with global stakeholders, provides data-driven insights and recommendations on complex problem statements.", "What Your Main Responsibilities Are", "Work cross-functionally to answer business questions by using appropriate statistical techniques on available data to improve key success metrics for LTL and freight business", "Build expertise while working on projects, work in a team to develop insights to strategize freight growth", "Partner with team to create presentations with strong storytelling capability to drive insights out of data", "Research and explore freight business trends impacting customer experience, operations, revenue. Work in a team to develop relevant recommendations to aid decision making", "Take ownership of problem statement, work actively with seniors team members to design solution delivery", "Import, clean, transform, validate data from RDBMS (Oracle, Teradata) with the purpose of understanding or making conclusions from the data for decision making.", "Skills", "What we are looking for", "Technical:", "SQL", "Visualization (PowerBI, spotfire, tableau, qlicksense, etc..)", "Python", "Functional", "Problem solving", "Consultative mindset", "Insights generation", "Behavioral", "Business communication and articulation", "Curiosity", "Sense of ownership", "Qualifications & Specifications", "Bachelor's degree in information systems, computer science, or a quantitative discipline such as mathematics, engineering, operations research, economics & statistics. Masters degree is a plus", "Experience of at least 2 - 4 years of analytics and statistics. Experience in freight industry is a plus", "Experience in product marketing analytics, impact analysis is a plus", "Must have - SQL & SAS/Python experience , with exposure to any visualization tools (PowerBI, Tableau , Spotfire), SQL", "Good to have – cloud computing, big data, Azure, NLP, ML", "FedEx was built on a philosophy that puts people first, one we take seriously. We are an equal opportunity/affirmative action employer and we are committed to a diverse, equitable, and inclusive workforce in which we enforce fair treatment, and provide growth opportunities for everyone.", "All qualified applicants will receive consideration for employment regardless of age, race, color, national origin, genetics, religion, gender, marital status, pregnancy (including childbirth or a related medical condition), physical or mental disability, or any other characteristic protected by applicable laws, regulations, and ordinances.", "Our Company", "FedEx is one of the world's largest express transportation companies and has consistently been selected as one of the top 10 World’s Most Admired Companies by \"Fortune\" magazine. Every day FedEx delivers for its customers with transportation and business solutions, serving more than 220 countries and territories around the globe. We can serve this global network due to our outstanding team of FedEx team members, who are tasked with making every FedEx experience outstanding.", "Our Philosophy", "The People-Service-Profit philosophy (P-S-P) describes the principles that govern every FedEx decision, policy, or activity. FedEx takes care of our people; they, in turn, deliver the impeccable service demanded by our customers, who reward us with the profitability necessary to secure our future. The essential element in making the People-Service-Profit philosophy such a positive force for the company is where we close the circle, and return these profits back into the business, and invest back in our people. Our success in the industry is attributed to our people. Through our P-S-P philosophy, we have a work environment that encourages team members to be innovative in delivering the highest possible quality of service to our customers. We care for their well-being, and value their contributions to the company.", "Our Culture", "Our culture is important for many reasons, and we intentionally bring it to life through our behaviors, actions, and activities in every part of the world. The FedEx culture and values have been a cornerstone of our success and growth since we began in the early 1970’s. While other companies can copy our systems, infrastructure, and processes, our culture makes us unique and is often a differentiating factor as we compete and grow in today’s global marketplace."]},
{"country": "India", "title": "not-found", "location": "not-found", "level": "not-found", "type": "not-found", "function": "not-found", "description": []},
{"country": "India", "title": "Data Scientist", "location": "India", "level": "Full-time", "type": "not-found", "function": "not-found", "description": ["", "Title:", "Data Scientist", "Company Description:", "Essential Lending is a fast-growing, analytics-driven financial services company, specializing in two primary areas: 1) short-term personal loans (Wise Loan), and 2) portfolio servicing, which includes predictive modeling/data-driven credit policy development, loan origination, and customer service (The Analytics Solutions).", "Headquartered in Fort Worth, Texas, our reach extends globally with a satellite call center in the Philippines and a diverse team of 40+ employees across Mexico, Brazil, the Dominican Republic, and India.", "Company Culture:", "At Essential Lending, our culture is more than just a set of values; it's a way of life that drives our success and makes us a better company for our employees and our customers. We are deeply committed to creating an environment where our values are not just spoken, but lived, day in and day out.", "Be a Transparent Advocate:", "We advocate for what's best for each other and our customers. We listen with curiosity, speak with candor, and act with compassion. When you feel good about working here, you're doing it right.", "Make Gratitude an Attitude:", "We embrace gratitude by being humble, attentive, clear, and empathetic, and we focus our conversations on positive outcomes.", "Look Beyond; Follow Through:", "We're unwavering in our commitment, deeply passionate about our work, and constantly seek opportunities for growth and learning. We take ownership, stay self-motivated, and consistently follow through.", "", "Position Overview:", "The Data Scientist will perform highly quantitative, data-driven analysis and make recommendations regarding how we should operate our business more effectively. While technical proficiency such as manipulating data with SQL and understanding predictive modeling techniques are necessary, the ideal candidate will have an aptitude for problem solving and business acumen.", "", "Key Responsibilities:", "As a Data Scientist at Essential Lending, you will engage in a variety of tasks aimed at optimizing our operations, below are a few examples:", "", "Credit Underwriting Model Development: Develop and refine credit underwriting models, assess their impact on our business, and apply them to existing loan portfolios. Evaluate payment performance by score and recommend score thresholds to maximize profitability.", "Pricing Optimization: Create linear programming optimization models to set pricing for potential loan applicants (leads). Develop an optimal pricing strategy that maximizes overall profit by considering applicant likelihood of loan approval, loan amounts, expected payment performance, and total loan volume.", "A/B Testing: Design and execute A/B tests to compare data vendors. Collaborate with our technology team to collect and analyze data, conduct a cost-benefit analysis, and recommending the most suitable data product for our needs.", "", "Position Requirements:", "We are looking for candidates with a diverse set of skills and experiences, from junior to mid-career levels, who demonstrate:", "", "Educational Qualification: A Bachelor's degree in Data Science, Statistics, or a related field is required.", "Professional Experience: A minimum of 1 years of hands-on experience as a data scientist is essential.", "Analytical Prowess: A natural talent for solving intricate business challenges through data analysis.", "Effective Communication: Exceptional communication skills, with a strong command of the English language, enabling clear and efficient collaboration with cross-functional teams.", "Statistical Expertise: Profound knowledge of statistical methods and the ability to employ predictive modeling techniques.", "SQL Proficiency: Proficiency in T-SQL is a must. The candidate should be capable of swiftly developing SQL queries to extract and manipulate data from various sources.", "Excel Mastery: Familiarity with Microsoft Excel is expected, with a willingness to acquire expertise in advanced Excel features like pivot tables and calculated fields.", "Programming Skills: Proficiency in Python is a prerequisite for this role, as the candidate will be responsible for developing and implementing machine learning algorithms and models.", "Data Analysis: Competence in collecting, cleaning, and preprocessing data from diverse sources to construct datasets for analysis.", "Machine Learning: Experience in developing and implementing machine learning algorithms and models using Python and AWS API calls.", "Feature Engineering: Proficiency in identifying and engineering relevant features for machine learning models.", "Model Evaluation: Skill in evaluating model performance, making improvements, and iteratively refining model development.", "Additional Knowledge (Plus Factors):", "Knowledge of direct mail marketing is considered a valuable asset.", "Familiarity with line of credit products is advantageous.", "Knowledge of SEO techniques is a beneficial addition to the skill set.", "Experience with lead generation is a welcomed advantage.", "", "If you are a motivated individual with a passion for leveraging data to drive business success and possess some of the skills and attributes outlined above, we encourage you to apply. This position offers a unique opportunity for both junior and mid-career professionals to contribute to our mission of empowering consumers with financial security and stability. Join us in reshaping the future of short-term lending!", ""]},
{"country": "India", "title": "Python Developer", "location": "India", "level": "Mid-Senior level", "type": "Full-time", "function": "Engineering and Information Technology", "description": ["", "We are hiring for our client - VirtueVin Solutions.", "Skills Required", "Python, Django, Pandas, Flask, ETL tools, PostgreeSQL, NoSQL", "Key Responsibilities", "Participate in the entire application lifecycle, focusing on coding and debugging", "Write clean, scalable code using Python programming language", "Collaborate with team members to determine best practices and client requirements", "Build efficient server-side applications", "Develop and implement software verification plans and quality assurance procedures", "Integrate user-facing elements into applications", "Test and debug programs", "Improve functionality of existing systems", "Implement security and data protection", "Assess and prioritize feature requests", "Coordinate with internal teams to understand user requirements and provide technical solutions", "Train and support internal teams on new technologies", "Stay up-to-date with industry trends and developments", "Mentor junior developers", "Required Qualifications", "Bachelor's degree in Computer Science, Engineering, or a related field", "Proven experience as a Python Developer or similar role", "Strong understanding of Python web frameworks such as Django, Flask, etc.", "Proficiency in using SQL and NoSQL databases", "Experience in developing RESTful APIs", "Knowledge of code versioning tools such as Git", "Familiarity with front-end technologies (e.g., JavaScript, HTML5, and CSS3)", "Excellent analytical and problem-solving skills", "Ability to work in a team environment", "Good communication and organizational skills", "Understanding of software design principles", "Experience with Agile development methodologies", "Strong unit test and debugging skills", "Familiarity with software development best practices", "Ability to prioritize and manage workload efficiently", "Skills: python,django,sql,git,pl/sql,couchbase,flask,code,pandas,etl tools"]},
{"country": "India", "title": "Business Analyst", "location": "Hyderabad, Telangana, India", "level": "Not Applicable", "type": "Full-time", "function": "Research, Analyst, and Information Technology", "description": ["JD - Business Analyst", "Roles & Responsibilities:", "Product Level:", "Manage large projects, develop and coordinate realistic project estimates, plans, working and", "communicating effectively with Engineering, Product Management, QA, Operations", "Understand New Age Media’s products, internal tools and processes and leverage those to push", "automation and increase work efficiency", "Using data and scientific management techniques to provide solutions to cater to various", "business needs", "Process Analysis to Improve Throughput, Quality and Operations and Forecasting", "○ Study the As Is processes and come up with To Be efficient processes. Mapping and", "Implementation", "○ Predicting resource and volume forecast for different processes", "Metrics and Scorecards preparation for various evaluations, comparisons", "○ Preparing Scorecards for competing entities ( vendors, admin , processes). Preparing", "Dashboard and Metrics for Program Managers", "○ User Response Analysis , Performance and Quality Measurement, New Metrics", "Definition", "Financial Analysis not limited to Cost Benefit, Price per Quantity , Resource and Overhead", "costing for various activities", "Project Management including Planning, coordination, Effort estimation, Reporting and", "Execution", "○ Coordinating entire project by integrating with different teams", "○ Driving the project and identifying parameters for next steps/enhancements", "Leveraging multiple teams/products for data enhancement", "Leading and assisting in special Pilot Projects related to Business and coming up with actionable", "recommendations", "Preparing Executive Level Presentations", "Participation and Analytical Suggestions in increasing user base/participation", "Operations:", "Lead the support team to drive analysis and perform pilot work/audit", "Lead analysis for the process, focusing on product features and user experience.", "Write detailed PRD for new proposals and get new workflows to improve the existing data", "Raise / Drive the feature request that will improve or affecting the process", "Review the policy documentation document and suggest improvements", "Suggest improvements to our workflow and processes", "Identify and propose initiatives to increase efficiency", "Qualifications:", "Qualifications And Experience", "We are looking for Business analytics/ Data analytics consultants with 5 to 7 years of exp.", "Candidate should have done a regular course of MBA in tier-1 or tier-2 B-school", "Business Analyst/ Data Analyst(Maps)"]},
{"country": "India", "title": "Senior Engineer, (Supply planning/ Analyst)", "location": "Bengaluru, Karnataka, India", "level": "Mid-Senior level", "type": "Full-time", "function": "Engineering", "description": ["", "Company Description", "At Western Digital, our vision is to power global innovation and push the boundaries of technology to make what you thought was once impossible, possible.", "At our core, Western Digital is a company of problem solvers. People achieve extraordinary things given the right technology. For decades, we’ve been doing just that. Our technology helped people put a man on the moon.", "We are a key partner to some of the largest and highest growth organizations in the world. From energizing the most competitive gaming platforms, to enabling systems to make cities safer and cars smarter and more connected, to powering the data centers behind many of the world’s biggest companies and public cloud, Western Digital is fueling a brighter, smarter future.", "Binge-watch any shows, use social media or shop online lately? You’ll find Western Digital supporting the storage infrastructure behind many of these platforms. And, that flash memory card that captures and preserves your most precious moments? That’s us, too.", "We offer an expansive portfolio of technologies, storage devices and platforms for business and consumers alike. Our data-centric solutions are comprised of the Western Digital®, G-Technology™, SanDisk® and WD® brands.", "Today’s exceptional challenges require your unique skills. It’s You & Western Digital. Together, we’re the next BIG thing in data.", "Job Description", "In this position, the individual will be responsible for full ownership of supply planning and customer order fulfillment for a particular product line. The role would involve working with product management, engineering, procurement, fab operations, silicon planning, demand planning, capacity planning, sales operations, business teams, supply chain process teams, and IT to ensure closure of the supply plan to meet demand within the planning horizon. Responsibilities include analyzing and resolving the daily plan output for supply to demand mismatches, producing weekly material and capacity plans to the factories, weekly closure of excess and obsolete inventory, and daily closure of inquiries from internal customers. Additionally, the individual should possess strong analytical skills to enhance and automate existing processes, or potentially make use of AI/ML techniques, in order to digitally transform the supply chain planning.", "The individual must be able to apply technical information to production or planning activities and confer with management personnel regarding purchases, procedures, product specification, manufacturing capabilities, and project status. Strong IE skills set would be required in order to apply the same in supply planning. The individual must possess exceptional interpersonal / team building skills, including the ability to communicate with all levels of the organization and participate with multi-functional teams.", "Qualifications", "Ideally, the candidate should have a Bachelor's degree with 3 plus years of experience or Master’s degree in Industrial & Operations Engineering or related fields, and under 2 years of work experience. MBA in operations management is a plus. Experience in using tools like Tableau, Power BI, SQL, MRP systems is highly beneficial. Further, experience and knowledge in the use of statistics and other analytical tools in process improvements is essential.", "Additional Information", "Western Digital thrives on the power and potential of diversity. As a global company, we believe the most effective way to embrace the diversity of our customers and communities is to mirror it from within. We believe the fusion of various perspectives results in the best outcomes for our employees, our company, our customers, and the world around us. We are committed to an inclusive environment where every individual can thrive through a sense of belonging, respect and contribution.", "Western Digital is committed to offering opportunities to applicants with disabilities and ensuring all candidates can successfully navigate our careers website and our hiring process. Please contact us at staffingsupport@wdc.com to advise us of your accommodation request. In your email, please include a description of the specific accommodation you are requesting as well as the job title and requisition number of the position for which you are applying."]},
{"country": "India", "title": "Data center Engineering Operations Manager, Infraops", "location": "Mumbai Metropolitan Region", "level": "Mid-Senior level", "type": "Full-time", "function": "Information Technology, Consulting, and Engineering", "description": ["", "DESCRIPTION", "Amazon is expanding the Data Center management team in India. This position within Amazon Data Services India Private Limited (ADSIPL) requires broad Data Center knowledge with Subject Matter Expertise (SME) in as many specific fields as possible. The location for this job to be discussed, as there may be opportunities in several India locations.", "This position serves as the primary operational resource to support ADSIPL within its owned and operated Data Centers in India. This position will provide a central point of ownership and accountability for the overall ‘hands-on’ management of the Mechanical, Electrical (M&E) and across ADSIPL’s portfolio of Data Centers in India. This position will be responsible for the overall operation and maintenance of the critical infrastructure supporting IT operations within the Indian Data Center space. It will also include event management, incident management, problem management, change management, and cost/contract management. In addition, this will include the relationship management with the landlords, critical facility vendors, Data Center Construction team, Data Center Operations team, Technical Program Managers, Security team, and Logistics team in India. The position will require 24x7 on-call, scheduled weekend work support and managing rotational shift.", "Responsibilities:", "Responsible for the on-site management of shift engineers, senior shift technicians, chief engineer,sub-contractors and vendors, ensuring that all work performed is in accordance with established practices and procedures.", "Has primary responsibility for availability zone of Data Centers (2-4 locations)", "Participates in strategic planning projects.", "Conducts financial analysis and contributes to financial decisions.", "Typically manages 5 or more direct reports.", "Negotiates and rolls out contracts and space.", "May oversee the build out of Facility-specific infrastructure in existing locations.", "Participates in recruiting efforts. Continually raises the bar.", "Is active in the training and/or development of others.", "Executes vision and goals for the team or department.", "Will conduct Project Management for multiple sites", "May participate in training of staff.", "Draws from a deep group or department level understanding to make business decisions.", "Uses business knowledge to set priorities and develop project plans.", "Has a deep understanding of best practices in their area of expertise and ensures their application.", "Strong verbal and written communication skills.", "Strong attention to detail and organizational skills.", "Able to prioritize in complex, fast-paced environment.", "Creates work plans and monitors accomplishments.", "Will contribute to the development of the project plan for the business group.", "Effectively sets priorities to meet goals on budget and on time.", "Demonstrates strong people/program management skills.", "Is resourceful, maintains effective pace and gets things done.", "May manage individuals and/or other managers in remote locations.", "Insists on the highest standards from self and others. Drives accountability for results.", "Keeps others informed of information that contributes to the performance of the team, department or company.", "Engenders trust and respect in all working relationships.", "Establish performance benchmarks, conduct analyses, and prepare reports on all aspects of the critical facility operations and maintenance.", "Work with IT managers and other business leaders to coordinate projects, manage capacity, and optimize plant safety, performance, reliability and efficiency.", "Operate and manage both routine and emergency services on a variety of critical systems such as: switchgear, generators, UPS systems, power distribution equipment, chillers, computer room air handlers, building monitoring systems, etc.", "May assist in the design and build out of new facilities.", "May assist in projects to increase current facility efficiency.", "Responsible for asset and inventory management.", "Assist in recruiting efforts.", "Deliver quality service and ensure all customer demands are met.", "Basic Qualifications", "An engineering degree or equivalent in an Electrical or Mechanical discipline.", "10+ years of relevant engineering experience managing large scale services.", "At least 3 years building strong, successful technical teams in a similar culture.", "High degree of organization and detail-orientation.", "Excellent written and verbal communications skills.", "Proven track record of success in delivering complex projects", "Prior ownership of the operation of a mission-critical team and/or product", "Ability to consistently deliver results despite competing priorities and distractions", "Preferred Qualifications", "An engineering degree or equivalent in an Electrical or Mechanical discipline.", "6+ years of relevant engineering experience managing large scale services.", "At least 3 years building strong, successful technical teams in a similar culture.", "High degree of organization and detail-orientation.", "Excellent written and verbal communications skills.", "Proven track record of success in delivering complex projects.", "Prior ownership of the operation of a mission-critical team and/or product.", "Ability to consistently deliver results despite competing priorities and distractions.", "Key job responsibilities", "Responsible for the on-site management of shift technicians, senior shift technicians, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices and procedures.", "Has primary responsibility for availability zone of Data Centers (2-4 locations)", "Participates in strategic planning projects.", "Conducts financial analysis and contributes to financial decisions.", "Typically manages 5 or more direct reports.", "Negotiates and rolls out contracts and space.", "May oversee the build out of Facility-specific infrastructure in existing locations.", "Participates in recruiting efforts. Continually raises the bar.", "Is active in the training and/or development of others.", "Executes vision and goals for the team or department.", "Will conduct Project Management for multiple sites", "May participate in training of staff.", "Draws from a deep group or department level understanding to make business decisions.", "Uses business knowledge to set priorities and develop project plans.", "Has a deep understanding of best practices in their area of expertise and ensures their application.", "Strong verbal and written communication skills.", "Strong attention to detail and organizational skills.", "Able to prioritize in complex, fast-paced environment.", "Creates work plans and monitors accomplishments.", "Will contribute to the development of the project plan for the business group.", "Effectively sets priorities to meet goals on budget and on time.", "Demonstrates strong people/program management skills.", "Is resourceful, maintains effective pace and gets things done.", "May manage individuals and/or other managers in remote locations.", "Insists on the highest standards from self and others. Drives accountability for results.", "Keeps others informed of information that contributes to the performance of the team, department or company.", "Engenders trust and respect in all working relationships.", "Establish performance benchmarks, conduct analyses, and prepare reports on all aspects of the critical facility operations and maintenance.", "Work with IT managers and other business leaders to coordinate projects, manage capacity, and optimize plant safety, performance, reliability and efficiency.", "Operate and manage both routine and emergency services on a variety of critical systems such as: switchgear, generators, UPS systems, power distribution equipment, chillers, computer room air handlers, building monitoring systems, etc.", "May assist in the design and build out of new facilities.", "May assist in projects to increase current facility efficiency.", "Responsible for asset and inventory management.", "Assist in recruiting efforts.", "Deliver quality service and ensure all customer demands are met.", "BASIC QUALIFICATIONS", "An engineering degree or equivalent in an Electrical or Mechanical discipline.", "10+ years of relevant engineering experience managing large scale services.", "At least 3 years building strong, successful technical teams in a similar culture.", "High degree of organization and detail-orientation.", "Excellent written and verbal communications skills.", "Proven track record of success in delivering complex projects", "Prior ownership of the operation of a mission-critical team and/or product", "Ability to consistently deliver results despite competing priorities and distractions", "PREFERRED QUALIFICATIONS", "An engineering degree or equivalent in an Electrical or Mechanical discipline.", "5+ years of relevant engineering experience managing large scale services.", "At least 3 years building strong, successful technical teams in a similar culture.", "High degree of organization and detail-orientation.", "Excellent written and verbal communications skills.", "Proven track record of success in delivering complex projects.", "Prior ownership of the operation of a mission-critical team and/or product.", "Ability to consistently deliver results despite competing priorities and distractions.", "Company", "- ADSIPL - Maharashtra", "Job ID: A2687903"]}{"country": "India", "title": "Python Developer", "location": "India", "level": "Mid-Senior level", "type": "Full-time", "function": "Engineering and Information Technology", "description": ["", "We are looking for a talented Python Developer to join VirtueVin Solutions.", "Desired Skills", "Python, Django, Pandas, Flask, ETL tools, PostgreeSQL, NoSQL", "Primary Responsibilities", "Engage in the complete application lifecycle, emphasizing on coding and troubleshooting", "Script clean, scalable code using Python", "Cooperate with team members to identify best practices and client needs", "Construct effective server-side applications", "Formulate and execute software validation plans and quality assurance procedures", "Incorporate user-facing elements into applications", "Examine and troubleshoot programs", "Enhance functionality of existing systems", "Implement security and data safeguarding", "Evaluate and prioritize feature requests", "Collaborate with internal teams to comprehend user requirements and provide technical solutions", "Train and aid internal teams on new technologies", "Stay informed about industry trends and advancements", "Guide junior developers", "Essential Qualifications", "Bachelor's degree in Computer Science, Engineering, or a related field", "Proven experience as a Python Developer or similar role", "Thorough understanding of Python web frameworks such as Django, Flask, etc.", "Proficiency in utilizing SQL and NoSQL databases", "Experience in developing RESTful APIs", "Knowledge of code versioning tools such as Git", "Familiarity with front-end technologies (e.g., JavaScript, HTML5, and CSS3)", "Excellent analytical and problem-solving abilities", "Capacity to work in a team environment", "Good communication and organizational skills", "Comprehension of software design principles", "Experience with Agile development methodologies", "Strong unit test and debugging skills", "Familiarity with software development best practices", "Ability to prioritize and manage workload efficiently", "Skills: sql,couchbase,etl,django,pl/sql,pandas,nosql,restful apis,flask,python,postgreesql,javascript,css3,code,html5,agile development,etl tools,git"]},
{"country": "India", "title": "Associate", "location": "Mumbai, Maharashtra, India", "level": "Entry level", "type": "Full-time", "function": "Other", "description": ["", "Line of Service", "Advisory", "Industry/Sector", "FS X-Sector", "Specialism", "Risk", "Management Level", "Associate", "Job Description & Summary", "A career within Cybersecurity and Privacy services, will provide you with the opportunity to help our clients implement an effective cybersecurity programme that protects against threats, propels transformation, and drives growth. As companies pivot toward a digital business model, exponentially more data is generated and shared among organisations, partners and customers. We play an integral role in helping our clients ensure they are protected by developing transformation strategies focused on security, efficiently integrate and manage new or existing technology systems to deliver continuous operational improvements and increase their cybersecurity investment, and detect, respond, and remediate threats.", "Preferred Fields of Study: Computer and Information Science, Information Technology, Computer Applications, Computer Engineering, Information CyberSecurity", "Certification(s) Preferred: Offensive Security Certified Professional (OSCP), GIAC Penetration Tester (GPEN), Certified as GIAC Web Application Penetration Tester (GWAPT).", "Preferred Knowledge/Skills", "Demonstrates thorough knowledge and/or a proven record of success in the following areas:", "Technical concepts such as application security, network segregation, access controls, IDS/IPS devices, physical security, and information security risk management;", "Security testing tools, such as BurpSuite, Mimikatz, Cobalt Strike, PowerSploit, Metasploit, Nessus, HP Web Inspect, or other tools included within the Kali Linux distribution;", "Networking protocols, TCP/IP stack, systems architecture, and operating systems;", "Common programming and scripting languages, such as Python, PowerShell, Ruby, Perl, Bash, JavaScript, or VBScript;", "Well-known Cybersecurity frameworks and industry-leading practices such as OWASP, NIST CSF, PCI DSS, and NY-DFS; and,", "Traditional security operations, event monitoring, and Security Information and Event Management (SIEM) tools.", "Demonstrates thorough abilities and/or a proven record of success in the following areas:", "Performing penetration testing activities within a client’s environment, emphasizing manual stealthy testing techniques;", "Executing stealthy penetration testing, advanced red team, or adversary simulation engagements using commercially / freely available offensive security tools and utilities built into operating systems;", "Understanding Windows and Linux operating system setup, management, and power usage, e.g., cmd, bash, network troubleshooting, virtual machines; .", "Identifying security critical vulnerabilities without utilizing a vulnerability scanning tool, i.e., knowledge of exploitable vulnerabilities and ability to execute stealthy penetration testing engagements;", "Compromising Active Directory environments and demonstrating business impact by identifying and obtaining access to business critical assets/information;", "Performing social engineering / phishing activities such as reconnaissance of targets, developing phishing campaigns (e.g., emails and websites), web hosting administrator, developing malicious phishing payloads, or pivoting through phished systems;", "Participating actively in client discussions and meetings and communicating a broad range of potential add-on services based on identified weaknesses;", "Managing engagements with junior staff;", "Preparing concise and accurate documents, leveraging and utilizing MS Office and Google Docs to complete related project deliverables, as necessary;", "Balancing project economics management with the occurrence of unanticipated issues.", "Creating a positive environment by monitoring workloads of the team while meeting client expectations and respecting the work-life quality of team members;", "Proactively seeking guidance, clarification, and feedback; and,", "Keeping leadership informed of progress and issues.", "Mandatory Skill set-", "VAPT", "Preferred Skill Set-VAPT", "Year of experience required-2-8 years", "Qualifications-B.Tech", "Education", "(if blank, degree and/or field of study not specified)", "Degrees/Field Of Study Required", "Degrees/Field of Study preferred:", "Certifications", "(if blank, certifications not specified)", "Required Skills", "Optional Skills", "Desired Languages", "(If blank, desired languages not specified)", "Travel Requirements", "Not Specified", "Available for Work Visa Sponsorship?", "No", "Government Clearance Required?", "No", "Job Posting End Date", ""]},
{"country": "India", "title": "Machine Learning Engineer", "location": "Hyderabad, Telangana, India", "level": "Mid-Senior level", "type": "Full-time", "function": "Information Technology", "description": ["", "Position: AI/ML Consultant (ON SITE)", "Location: Jubilee Hills, (Hyderabad)", "Working hours : 1 PM to 10 PM", "Monday to Friday", "Salary open", "Need candidate above 3 years", "Qualifications:", "• Need 3 years + experience.", "• Bachelor’s or Master’s degree in Computer Science, Engineering, or a related field", "• Strong programming skills in Python, R, Java, and/or C++", "• Expertise in machine learning, deep learning, natural language processing, and computer vision", "• Proficiency with AI frameworks such as TensorFlow, PyTorch, or Keras", "• Experience with cloud platforms (e.g., AWS, Google Cloud, Azure) for AI deployment", "• Solid understanding of data structures, algorithms, and software design principles", "• Excellent problem-solving skills and the ability to work in a collaborative team environment", "• Strong communication skills", "Thanks", "benjamin.wilson@panzersolutions.com", ""]},
{"country": "India", "title": "Management Trainee – Data Scientist-COR029320", "location": "Gurugram, Haryana, India", "level": "Associate", "type": "Full-time", "function": "General Business", "description": ["Genpact (NYSE: G) is a global professional services and solutions firm delivering outcomes that shape the future. Our 125,000+ people across 30+ countries are driven by our innate curiosity, entrepreneurial agility, and desire to create lasting value for clients. Powered by our purpose – the relentless pursuit of a world that works better for people – we serve and transform leading enterprises, including the Fortune Global 500, with our deep business and industry knowledge, digital operations services, and expertise in data, technology, and AI", "Inviting applications for the role of Management Trainee – Data Scientist", "We are seeking an experienced and skilled Developer-Data Scientist to join our team. In this role, you will be responsible for driving data-driven decision-making and delivering actionable insights through advanced data modelling, statistical analysis, and machine learning techniques. You will leverage your expertise in various domains, including classification, regression, graph transformers, and root cause analysis, to solve complex business problems and drive innovation.", "Roles And Responsibilities", "Design, develop, and implement statistical, machine learning, and deep learning models to solve complex business problems", "Hands on Python application development", "Fine-tune transformer models for specific tasks and domains", "Perform ETL (Extract, Transform, Load) activities to prepare data for analysis and modelling.", "Implement and maintain ML-Ops practices to ensure efficient model deployment and management", "Analyse large datasets using advanced statistical methods and machine learning techniques", "Develop and maintain Python-based data processing and analysis scripts", "Present findings and recommendations to stakeholders in a clear, understandable manner", "Qualifications", "Minimum qualifications", "Relevant years of experience in data science and machine learning roles, with a strong understanding of data modelling, statistical analysis, and machine learning techniques.", "Engineering in relation fields like Computer Science, IT, ML, Data Science", "ML Ops Certification in AWS or Azure", "Strong proficiency in Python programming, including libraries such as NumPy, Pandas, Scikit-learn, PyTorch", "Extensive experience with deep learning frameworks and techniques", "Hands-on experience fine-tuning transformer models (e.g., BERT, GPT, T5)", "Knowledge of database systems (e.g., SQL, NoSQL) and experience with data warehousing and data lake architectures.", "Experience with ETL processes and working with data warehouses", "Solid understanding of statistical modelling, machine learning algorithms, and their practical applications", "Preferred Qualifications", "Familiarity with cloud computing platforms (e.g., AWS, Azure, GCP) and their data services.", "Familiarity with MLOps practices and tools (e.g., MLflow, Kubeflow, or similar)", "Strong understanding of classification, regression, and graph transformer techniques, as well as their applications in various domains.", "Experience in root cause analysis and implementing statistical methods for causal inference and experimental design.", "Excellent problem-solving, analytical, and critical thinking skills.", "Strong communication and collaboration abilities, with the ability to work effectively in cross-functional teams.", "Passion for staying up-to-date with the latest advancements in data science, machine learning, and related technologies.", "Genpact is an Equal Opportunity Employer and considers applicants for all positions without regard to race, color, religion or belief, sex, age, national origin, citizenship status, marital status, military/veteran status, genetic information, sexual orientation, gender identity, physical or mental disability or any other characteristic protected by applicable laws. Genpact is committed to creating a dynamic work environment that values diversity and inclusion, respect and integrity, customer focus, and innovation. Get to know us at genpact.com and on LinkedIn, X, YouTube, and Facebook.", "Furthermore, please do note that Genpact does not charge fees to process job applications and applicants are not required to pay to participate in our hiring process in any other way. Examples of such scams include purchasing a 'starter kit,' paying to apply, or purchasing equipment or training", "Job", "Management Trainee", "Primary Location", "India-Gurugram", "Education Level", "Bachelor's / Graduation / Equivalent", "Job Posting", "Sep 9, 2024, 6:39:32 AM", "Unposting Date", "Oct 9, 2024, 6:29:00 PM", "Master Skills List", "Corporate", "Job Category", "Full Time"]},
{"country": "India", "title": "Data Scientist", "location": "Chennai, Tamil Nadu, India", "level": "Mid-Senior level", "type": "Full-time", "function": "Information Technology", "description": ["", "Tiger Analytics is a global AI and analytics consulting firm. With data and technology at the core of our solutions, our 3900+ tribe is solving problems that eventually impact the lives of millions globally. Our culture is modeled around expertise and respect with a team-first mindset. Headquartered in Silicon Valley, you’ll find our delivery centers across the globe and offices in multiple cities across India, the US, UK, Canada, and Singapore, including a substantial remote global workforce. We’re Great Place to Work-Certified™. Working at Tiger Analytics, you’ll be at the heart of an AI revolution. You’ll work with teams that push the boundaries of what is possible and build solutions that energize and inspire.", "About the role :", "As a Data Scientist, you will be at the forefront of driving innovation through cutting-edge data analytics and machine learning applications across diverse industries. On a typical day, immerse yourself in the following:", "Analytical Translation:", "Translate complex business problems into sophisticated analytical structures, conceptualising solutions anchored in statistical and machine learning methodologies.", "Problem Solving:", "While technical proficiency in data manipulation, statistical modelling, and machine learning is crucial, the ability to apply these skills to solve real-world business problems is equally vital.", "Client Engagement:", "Establish a deep understanding of clients' business contexts, working closely to unravel intricate challenges and opportunities.", "Algorithmic Expertise:", "Develop and refine algorithms and models, sculpting them into powerful tools to surmount intricate business challenges.", "Quantitative Mastery:", "Conduct in-depth quantitative analyses, navigating vast datasets to extract meaningful insights that drive informed decision-making.", "Cross-Functional Collaboration:", "Collaborate seamlessly with multiple teams, including Consulting and Engineering, fostering relationships with diverse stakeholders to meet deadlines and bring Analytical Solutions to life.", "Desired Skills and Experience :", "4 -7 years of Relevant Data Science Experience, with demonstrated proficiency and hands-on experience navigating data science complexities.", "Good communication skills, both verbal and written.", "Exhibit a fervour for crafting modular, scalable, and bug-free Python code.", "Comfortable in SQL with additional proficiency in office tools like Excel & PowerPoint.", "Experience in production engineering best practices (e.g. Git versioning, Docker).", "Familiarity or experience with working on large data sets and distributed computing (e.g. Hive, Hadoop, Spark)", "Working knowledge of Cloud platforms (e.g. AWS, Azure, GCP).", "Excitement to collaborate with diverse stakeholders across the organisation.", "In-depth understanding of various data science approaches, machine learning algorithms, and statistical methods.", "Hunger to learn new technologies and embrace the change.", "Proficiency in foundational concepts and algorithms in machine learning, encompassing regression and classification techniques, and a keen awareness of their assumptions, strengths, and limitations.", "Must-Have Skills: Regression/Classification/Optimization/ Python Proficiency in these key skills is crucial to thriving in this role.", "Note: The designation will be commensurate with expertise and experience. Compensation packages are among the best in the industry", ".", ""]},
{"country": "India", "title": "Director Data Science", "location": "Hyderabad, Telangana, India", "level": "Director", "type": "Full-time", "function": "Information Technology", "description": ["", "Position Summary", "MetLife established a Data and Analytics center in Hyderabad to scale and mature Data and Analytics capabilities in a cost-effective manner and make MetLife future ready. The center is integral to Global Data and Analytics’ talent strategy with a focus to protect & build MetLife IP, promote reusability and drive experimentation and innovation. The team in India mirrors the global DnA team with focus across Data science, Enterprise business intelligence, Data Governance, Data Quality, Solutions Engineering and Agile Delivery. In partnership with Business, IT, DnA colleagues in other geographies, the team has been delivering data & analytics solutions for the Enterprise across lines of businesses, corporate functions, markets, and products.", "Role Value Proposition", "To drive the development and delivery of end-to-end data and analytics solutions for key insurance business functions such as claims service &operations, customer acquisition, customer engagement & retention, distribution, investments, marketing, risk management and underwriting. The role will collaborate with partners from Business, operations, technology and risk management functions to develop scalable and responsible AI solutions.", "Job Responsibilities", "Drive business transformation using Data, Analytics and AI", "Lead all stages of Data, analytics & AI product development life cycle: from problem identification, conceptualization, prioritization to solution development and delivery.", "Collaborate with business and technology partners to co-create solutions anchored on customer care, human-centered design, frictionless services, and meaningful engagement.", "Engage in open-ended conversations, navigate through ambiguous situations and develop clarity.", "Develop Data and Analytics roadmaps. Deliver solutions with transformational impact to the Enterprise.", "Communicate, engage, and present roadmaps, use cases, solutions, & impact to executive/senior management.", "Deliver products and solutions in a timely, proactive, and entrepreneurial manner.", "Institutionalize best practices, contribute to research and experimentation efforts.", "Accelerate solution delivery using re-usable frameworks, prototypes and hackathons.", "People leadership: talent acquisition, coaching and mentoring team.", "Education, Technical Skills & Other Critical Requirement", "Bachelor’s/ Master’s degree in an information technology/computer science or relevant domain. MBA or financial services industry experience preferred;", "12-18+ years of relevant experience in data and analytics product & solution delivery", "Traditional as well as modern statistical and machine learning techniques", "Azure ML, OpenAI, Python, PyTorch , SQL, and TensorFlow.", "Experience working with large and complex internal, external, structured, and unstructured datasets.", "Responsible deployment of AI. Technical documentation for solutions.", "Solution Engineering and Consultative skills: Strong conceptual and creative problem-solving skills; empathy led engagement with focus on stakeholder motivation, needs and aspirations.", "Agile methodologies & tools.", "Excellent written, verbal communication skills and presentation skills; engage in meaningful manner with variety of audience: business stakeholders, technology partners & practitioners, executive and senior management.", "Proven record in driving data & analytics/digital transformation in large organizations", "Industry knowledge about emerging AI trends, AI tools and technologies", "Preferred", "New age AI and ML techniques such as GenAI, foundational models, large language models (LLMs) and applications", "ML Ops, AI Ops, Generative AI, Ethical AI, AI in cloud(Azure, AWS, Google Could Platform etc)", "Management consulting experience", "Data management, Data engineering, Data governance, Data operations, Data on Cloud", ""]},
{"country": "India", "title": "Python Data Engineer", "location": "Bengaluru, Karnataka, India", "level": "Mid-Senior level", "type": "Contract", "function": "Information Technology", "description": ["", "Role: Python Data Engineer", "Company: WillWare Technologies", "Experience: (5-7) years", "Location: Remote / Contract", "The Data Science team needs assistance with engineering around their Data Science work. The focus is on Engineering more than Data Science. The Data Science team is very strong, but what they need is engineering help without having to explain all of the concepts. Below is a list of capabilities looking for in a candidate", "Critical Required", "Capable of developing APIs using Azure Functions, SQLAlchemy, Snowpark, and Pydantic.", "High", "Capable of integrating testing using pytest", "Decent level of SQL understanding. Selects, joins, filters, CTE's", "Important", "Familiar with Plotly/Dash/Flask, HTML/CSS, and developing UIs for web", "applications in Python", "Familiarity with language modeling, particularly with Langchain and OpenAI", "Nice To Have", "Familiarity with investment management, particularly equity risk and", "performance Experience with AzureML, Kubernetes, and web scraping", ""]},
{"country": "India", "title": "Sr. Data Scientist, Software Engineering", "location": "Bengaluru, Karnataka, India", "level": "Mid-Senior level", "type": "Full-time", "function": "Engineering and Information Technology", "description": ["Senior Engineer, Software Engineering (AI/ML)", "BENGALURU /", "RESEARCH AND DEVELOPMENT – ENGINEERING /", "FULL-TIME", "Saviynt is a leading provider of Cloud Security and Identity Governance solutions. Saviynt enables enterprises", "to secure applications, data, and infrastructure in a single platform for Cloud (Office 365, AWS, Azure,", "Salesforce, Workday) and Enterprise (SAP, Oracle EBS). Saviynt is pioneering Identity Governance", "Administration by integrating advanced risk analytics and intelligence with fine-grained privilege management.", "We are seeking a highly skilled and experienced Senior Software Developer with a strong background in", "designing and developing code for Generative Artificial Intelligence (AI) and Machine Learning (ML)", "applications. As a Senior Software Developer, you will play a crucial role in architecting, implementing, and", "optimizing advanced AI and ML models to create innovative and cutting-edge solutions.", "Responsibilities", "Lead the design, development, and implementation of generative AI and ML models and algorithms", "for various applications, including image generation, natural language processing, and data", "synthesis.", "Collaborate with cross-functional teams, including data scientists, software engineers, and product", "managers, to gather requirements and define technical specifications for AI-based projects.", "Architect scalable and efficient ML solutions, leveraging state-of-the-art algorithms and frameworks", "to achieve high-performance and accuracy.", "Mentor and guide junior team members, providing technical expertise and ensuring best practices", "in AI and ML development.", "Research and experiment with the latest advancements in generative AI and ML, and apply cutting-", "edge techniques to solve complex challenges.", "Design and optimize data pipelines for training and deploying AI models using large-scale datasets.", "Implement and maintain the codebase for AI applications, ensuring code quality, modularity, and", "reusability.", "Conduct thorough testing and debugging of AI models to ensure robustness and reliability in real-", "world scenarios.", "Collaborate in the development of APIs and user interfaces to integrate AI capabilities into products", "and services.", "Requirements", "Bachelor's or Master's degree in Computer Science, Engineering, or a related field.", "6+ years of experience in programming languages like Python, Java.", "3+ years of experience with proficiency in popular ML frameworks (TensorFlow, PyTorch, Keras,", "scikit-learn etc.)", "Should have experience of developing and supporting the product with multitenant microservices", "architecture.", "proven track record of successful AI and ML development projects, with a focus on generative", "models.", "Deep understanding of neural networks, deep learning, and generative models (e.g., GANs, VAEs,", "etc.).", "Hands-on experience with distributed computing, cloud platforms, and GPU acceleration for AI", "development.", "Strong analytical and problem-solving skills, with the ability to think creatively to address complex", "challenges.", "Solid understanding of software development best practices, version control systems, and agile", "methodologies.", "Excellent communication and interpersonal skills, with the ability to collaborate effectively within a", "team and with stakeholders.", "Demonstrated ability to work on multiple projects simultaneously and deliver high-quality results", "within tight deadlines.", "A passion for continuous learning and a drive to push the boundaries of AI and ML technologies.", "Join our talented team of innovators and contribute to the development of cutting-edge generative AI and", "ML solutions. As a Senior Software Developer, you will have the opportunity to shape the future of AI", "applications and make a significant impact on our organization's success."]},
{"country": "India", "title": "not-found", "location": "not-found", "level": "not-found", "type": "not-found", "function": "not-found", "description": []},
{"country": "India", "title": "not-found", "location": "not-found", "level": "not-found", "type": "not-found", "function": "not-found", "description": []},
{"country": "India", "title": "not-found", "location": "not-found", "level": "not-found", "type": "not-found", "function": "not-found", "description": []},
{"country": "India", "title": "python Developer", "location": "Bengaluru, Karnataka, India", "level": "Executive", "type": "Full-time", "function": "Engineering and Information Technology", "description": ["", "Company Overview", "CN Solutions is a leading IT services and IT consulting company with expertise in various domains including Web Technologies, Databases, Software Testing, CRM, ERP, Data warehousing, Middleware, ESM, Business Analyst, Cyber Security, and SAP Hiring. We provide a range of services including Staffing Solutions, Leadership Hiring, RPO, and General Staffing. With a team of highly experienced professionals, we are dedicated to delivering first-class solutions to our clients' manpower requirements.", "Job Overview", "We are seeking a talented Python Developer to join our team at CN Solutions. As a Python Developer, you will be responsible for developing and maintaining high-quality software applications using Python programming language. This is a full-time position based in Pune, Maharashtra, India. The ideal candidate should have 1 to 3 years of experience as a Junior Python Developer.", "Qualifications And Skills", "Bachelor's degree in Computer Science, Engineering, or a related field", "1 to 3 years of experience as a Junior Python Developer", "Strong knowledge of Python programming language", "Experience with Python frameworks such as Django or Flask", "Familiarity with front-end technologies such as HTML, CSS, and JavaScript", "Good understanding of software development principles and best practices", "Ability to work in a fast-paced and collaborative environment", "Excellent problem-solving and communication skills", "Attention to detail and strong organizational skills", "Roles And Responsibilities", "Designing and implementing software applications using Python programming language", "Collaborating with cross-functional teams to define, design, and ship new features", "Maintaining and enhancing existing software applications", "Writing clean, maintainable, and efficient code", "Troubleshooting and debugging issues in the software applications", "Performing unit testing and ensuring software quality", "Keeping up-to-date with the latest industry trends and technologies", ""]},
{"country": "India", "title": "not-found", "location": "not-found", "level": "not-found", "type": "not-found", "function": "not-found", "description": []},
{"country": "India", "title": "not-found", "location": "not-found", "level": "not-found", "type": "not-found", "function": "not-found", "description": []},
{"country": "India", "title": "Jr Associate, BI", "location": "Pune, Maharashtra, India", "level": "Mid-Senior level", "type": "Full-time", "function": "Information Technology", "description": ["", "Job Description", "Analytical support for senior team members and Client Business Partners. A BI Reporting Associates will be in support of one or several clients, operating as part of a broader international community, both analytical and commercial, working towards a common goal of supporting the Clients in achieving their strategic business objectives.", "Responsibilities", "Monitor BAU reports and automated processes", "Maintain regular client reports (refresh data, check or add comments, implement changes, address technical issues, manage the delivery calendar and the deliveries)", "Review data for errors and inconsistencies, flag data quality issues", "Deliver quick turn requests", "Suggest and implement ways of improving/automating existing deliverables", "Share and actively search for best practice examples, and implement the approach in own work whenever possible", "Qualifications", "College under graduate - Marketing, Economics or related field, or technical/engineering studies", "Strong numerical and analytical skills", "Very good knowledge of Microsoft Excel (pivot tables, vlookup, conditional functions, conditional formatting, chart building, and formatting); knowledge of VBA is an asset, PowerPoint", "Automation & Process aware", "QA proficient", "Operational focus", "Proactive, flexible and self-motivated attitude", "Strong communication skills, ability to document, present and educate others", "Willingness to take ownership and see projects to completion", "Ability to anticipate the bigger picture and are holistic by nature", "Experience and desire to create process documentation", "Fluent communication in English - verbal and written (at least C1 level)", "Results-oriented personality and ability to work to tight deadlines", "Good time- and workload management skills", "Ability to work both independently and as a team player", "Experience in working in a virtual environment and in a multicultural setting", "Diligence and attention to detail", "Additional Information", "Enjoy a flexible and rewarding work environment with peer-to-peer recognition platforms.", "Recharge and revitalize with help of wellness plans made for you and your family.", "Plan your future with financial wellness tools.", "Stay relevant and upskill yourself with career development opportunities.", "Our Benefits", "Flexible working environment", "Volunteer time off", "LinkedIn Learning", "Employee-Assistance-Program (EAP)", "About NIQ", "NIQ is the world’s leading consumer intelligence company, delivering the most complete understanding of consumer buying behavior and revealing new pathways to growth. In 2023, NIQ combined with GfK, bringing together the two industry leaders with unparalleled global reach. With a holistic retail read and the most comprehensive consumer insights—delivered with advanced analytics through state-of-the-art platforms—NIQ delivers the Full View™. NIQ is an Advent International portfolio company with operations in 100+ markets, covering more than 90% of the world’s population.", "For more information, visit NIQ.com", "Want to keep up with our latest updates?", "Follow us on: LinkedIn | Instagram | Twitter | Facebook", "Our commitment to Diversity, Equity, and Inclusion", "NIQ is committed to reflecting the diversity of the clients, communities, and markets we measure within our own workforce. We exist to count everyone and are on a mission to systematically embed inclusion and diversity into all aspects of our workforce, measurement, and products. We enthusiastically invite candidates who share that mission to join us. We are proud to be an Equal Opportunity/Affirmative Action-Employer, making decisions without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability status, age, marital status, protected veteran status or any other protected class. Our global non-discrimination policy covers these protected classes in every market in which we do business worldwide. Learn more about how we are driving diversity and inclusion in everything we do by visiting the NIQ News Center: https://nielseniq.com/global/en/news-center/diversity-inclusion"]},
{"country": "India", "title": "Senior Data Research Engineer -Database Engineer", "location": "Mumbai Metropolitan Region", "level": "Executive", "type": "Full-time", "function": "Engineering", "description": ["", "Company Description", "Forbes Advisor is a new initiative for consumers under the Forbes Marketplace umbrella that provides journalist- and expert-written insights, news and reviews on all things personal finance, health, business, and everyday life decisions. We do this by providing consumers with the knowledge and research they need to make informed decisions they can feel confident in, so they can get back to doing the things they care about most.", "The Data Research Engineering Team is a brand new team with the purpose of managing data from acquisition to presentation, collaborating with other teams while also operating independently. Their responsibilities include acquiring and integrating data, processing and transforming it, managing databases, ensuring data quality, visualizing data, automating processes, working with relevant technologies, and ensuring data governance and compliance. They play a crucial role in enabling data-driven decision-making and meeting the organization's data needs.", "A typical day in the life of a Junior Database Engineer/Developer will involve designing, developing, and maintaining a robust and secure database infrastructure to efficiently manage company data. They collaborate with cross-functional teams to understand data requirements and migrate data from spreadsheets or other sources to relational databases or cloud-based solutions like Google BigQuery and AWS. They develop import workflows and scripts to automate data import processes, optimize database performance, ensure data integrity, and implement data security measures. Their creativity in problem-solving and continuous learning mindset contribute to improving data engineering processes. Proficiency in SQL, database design principles, and familiarity with Python programming are key qualifications for this role.", "Responsibilities", "Job Description", "Design, develop, and maintain the database infrastructure to store and manage company data efficiently and securely.", "Work with databases of varying scales, including small-scale databases, and databases involving big data processing.", "Work on data security and compliance, by implementing access controls, encryption, and compliance standards (GDPR).", "Collaborate with cross-functional teams to understand data requirements and support the design of the database architecture.", "Migrate data from spreadsheets or other sources to a relational database system (e.g., PostgreSQL, MySQL) or cloud-based solutions like Google BigQuery.", "Develop import workflows and scripts to automate the data import process and ensure data accuracy and consistency.", "Optimize database performance by analyzing query execution plans, implementing indexing strategies, and improving data retrieval and storage mechanisms.", "Work with the team to ensure data integrity and enforce data quality standards, including data validation rules, constraints, and referential integrity.", "Monitor database health and identify and resolve issues.", "Collaborate with the full-stack web developer in the team to support the implementation of efficient data access and retrieval mechanisms.", "Implement data security measures to protect sensitive information and comply with relevant regulations.", "Demonstrate creativity in problem-solving and contribute ideas for improving data engineering processes and workflows.", "Embrace a learning mindset, staying updated with emerging database technologies, tools, and best practices.", "Explore third-party technologies as alternatives to legacy approaches for efficient data pipelines.", "Familiarize yourself with tools and technologies used in the team's workflow, such as Knime for data integration and analysis.", "Use Python for tasks such as data manipulation, automation, and scripting.", "Collaborate with the Data Research Engineer to estimate development efforts and meet project deadlines.", "Assume accountability for achieving development milestones.", "Prioritize tasks to ensure timely delivery, in a fast-paced environment with rapidly changing priorities.", "Collaborate with and assist fellow members of the Data Research Engineering Team as required.", "Perform tasks with precision and build reliable systems.", "Leverage online resources effectively like StackOverflow, ChatGPT, Bard, etc., while considering their capabilities and limitations.", "Skills And Experience", "Bachelor's degree in Computer Science, Information Systems, or a related field is desirable but not essential.", "Knowledge of database development and administration concepts, especially with relational databases like PostgreSQL or MySQL.", "Knowledge of SQL and understanding of database design principles, normalization, and indexing.", "Knowledge of data migration, ETL (Extract, Transform, Load) processes, or integrating data from various sources.", "Knowledge of cloud-based databases, such as Google BigQuery and AWS RDS.", "Eagerness to develop import workflows and scripts to automate data import processes.", "Ideally, familiarity with Knime or similar tools for data integration and analysis.", "Knowledge of data security best practices, including access controls, encryption, and compliance standards (e.g., GDPR, HIPAA).", "Strong problem-solving and analytical skills with attention to detail.", "Creative and critical thinking.", "Strong willingness to learn and expand knowledge in data engineering.", "Knowledge of Python programming, including data manipulation and automation, and with modules such as Pandas, SQLAlchemy, gspread, PyDrive, PySpark.", "Familiarity with Agile development methodologies is a plus.", "Familiarity with Docker containers or similar technologies is a plus.", "Experience with version control systems, such as Git, for collaborative development.", "Ability to thrive in a fast-paced environment with rapidly changing priorities.", "Ability to work collaboratively in a team environment.", "Good and effective communication skills.", "Comfortable with autonomy and ability to work independently.", "Qualifications", "Bachelor's degree in Computer Science, Information Systems, or a related field is desirable but not essential.", "Additional Information", "All your information will be kept confidential according to EEO guidelines."]},
{"country": "India", "title": "not-found", "location": "not-found", "level": "not-found", "type": "not-found", "function": "not-found", "description": []},
{"country": "India", "title": "not-found", "location": "not-found", "level": "not-found", "type": "not-found", "function": "not-found", "description": []},
{"country": "India", "title": "not-found", "location": "not-found", "level": "not-found", "type": "not-found", "function": "not-found", "description": []},
{"country": "India", "title": "Python Developer", "location": "India", "level": "Mid-Senior level", "type": "Full-time", "function": "Engineering and Information Technology", "description": ["", "Skills Required", "Python, Django, Pandas, Flask, ETL tools, PostgreeSQL, NoSQL", "Key Responsibilities", "Participate in the entire application lifecycle, focusing on coding and debugging", "Write clean, scalable code using Python programming language", "Collaborate with team members to determine best practices and client requirements", "Build efficient server-side applications", "Develop and implement software verification plans and quality assurance procedures", "Integrate user-facing elements into applications", "Test and debug programs", "Improve functionality of existing systems", "Implement security and data protection", "Assess and prioritize feature requests", "Coordinate with internal teams to understand user requirements and provide technical solutions", "Train and support internal teams on new technologies", "Stay up-to-date with industry trends and developments", "Mentor junior developers", "Required Qualifications", "Bachelor's degree in Computer Science, Engineering, or a related field", "Proven experience as a Python Developer or similar role", "Strong understanding of Python web frameworks such as Django, Flask, etc.", "Proficiency in using SQL and NoSQL databases", "Experience in developing RESTful APIs", "Knowledge of code versioning tools such as Git", "Familiarity with front-end technologies (e.g., JavaScript, HTML5, and CSS3)", "Excellent analytical and problem-solving skills", "Ability to work in a team environment", "Good communication and organizational skills", "Understanding of software design principles", "Experience with Agile development methodologies", "Strong unit test and debugging skills", "Familiarity with software development best practices", "Ability to prioritize and manage workload efficiently", "Skills: python,django,sql,git,pl/sql,couchbase,flask,code,pandas,etl tools"]},
{"country": "India", "title": "not-found", "location": "not-found", "level": "not-found", "type": "not-found", "function": "not-found", "description": []},
{"country": "India", "title": "not-found", "location": "not-found", "level": "not-found", "type": "not-found", "function": "not-found", "description": []},
{"country": "India", "title": "not-found", "location": "not-found", "level": "not-found", "type": "not-found", "function": "not-found", "description": []},
{"country": "India", "title": "not-found", "location": "not-found", "level": "not-found", "type": "not-found", "function": "not-found", "description": []},
{"country": "India", "title": "not-found", "location": "not-found", "level": "not-found", "type": "not-found", "function": "not-found", "description": []}
]